backend/1c-config/TradeUkr23/src/Catalogs/венд_МобильныеУстройства.xml
<?xml version="1.0" encoding="utf-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>венд_МобильныеУстройства</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторУстройства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<Attribute>
				<Properties>
					<Name>АвтоПроведение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПривязки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешТокена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заблокировано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

backend/1c-config/TradeUkr23/src/Catalogs/венд_МобильныеУстройства/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

// Новий пристрій: ідентифікатор = GUID його посилання (за ним 1С знаходить пристрій,
// він же кодується в QR як deviceId). Заповнюємо вже при створенні, щоб показати у формі.
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ЗаполнитьИдентификаторУстройства();
	ЗаполнитьКодПривязки();
КонецПроцедуры

// Копія — це інший пристрій: скидаємо ідентифікатор/код/хеш, щоб не дублювати deviceId
// і токен джерела; новий ідентифікатор і код присвоюються нижче.
Процедура ПриКопировании(ОбъектКопирования)
	ИдентификаторУстройства = "";
	КодПривязки = "";
	ХешТокена = "";
	ЗаполнитьИдентификаторУстройства();
	ЗаполнитьКодПривязки();
КонецПроцедуры

// Підстраховка для програмного створення: якщо ідентифікатор досі порожній — присвоюємо.
Процедура ПередЗаписью(Отказ)
	ЗаполнитьИдентификаторУстройства();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьИдентификаторУстройства()
	ПустойГУИД = "00000000-0000-0000-0000-000000000000";
	Если ЗначениеЗаполнено(ИдентификаторУстройства) И ИдентификаторУстройства <> ПустойГУИД Тогда
		Возврат;
	КонецЕсли;
	Если ЭтоНовый() Тогда
		// Явно генеруємо GUID і фіксуємо його як посилання нового елемента (як у HTTP-сервісі).
		// ПолучитьСсылкуНового() у цій платформі повертав порожній GUID, тому робимо детерміновано.
		НовыйИД = Новый УникальныйИдентификатор();
		УстановитьСсылкуНового(Справочники.венд_МобильныеУстройства.ПолучитьСсылку(НовыйИД));
		ИдентификаторУстройства = Строка(НовыйИД);
	Иначе
		ИдентификаторУстройства = Строка(Ссылка.УникальныйИдентификатор());
	КонецЕсли;
КонецПроцедуры

// Одноразовий код прив'язки (GUID без дефісів). Генеруємо при створенні, щоб QR можна було
// показати одразу. Кнопка у формі перегенеровує його (переприв'язка).
Процедура ЗаполнитьКодПривязки()
	Если Не ЗначениеЗаполнено(КодПривязки) Тогда
		КодПривязки = СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
